# SlantedColumnBaseExtension Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SlantedColumnBaseExtension Property
ParameterTypeId Class See Also
---
"Base Extension"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SlantedColumnBaseExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlantedColumnBaseExtension As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlantedColumnBaseExtension {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace